# Задание 9 лабораторная 3
# Вариант 1
# Збаразский С.С

main_list = [
    ["Ватутіне", "Черкаська обл.", 16665, 10.89],
    ["Золотоноша", "Черкаська обл.", 28259, 21.65],
    ["Канів", "Черкаська обл.", 23884, 17.42],
    ["Корсунь-Шевченківський", "Черкаська обл.", 19328, 118.65],
    ["Сміла", "Черкаська обл.", 68805, 39.85],
    ["Черкаси", "Черкаська обл.", 277944, 69],
    ["Чигирин", "Черкаська обл.", 8995, 10.7],
    ["Бориспіль", "Київська обл.", 61613, 37.01],
    ["Бровари", "Київська обл.", 106185, 34],
    ["Київ", "Київська обл.", 2949558, 847.66],
    ["Переяслав-Хмельницький", "Київська обл.", 27548, 32],
    ["Одеса", "Одеська обл.", 1017032, 33310]
]

start = float(input("Задайте начало диапазона: "))
end = float(input("Задайте конец диапазона: "))

satisfy, not_satisfy = [], []
for el in main_list:
    (satisfy if start <= el[3] <= end else not_satisfy).append(el)

print("В диапазоне:", satisfy)
print("Не входит в диапазон:", not_satisfy)
