# Задание 7 лабораторная 2
# Вариант 1
# Збаразский С.С

n = int(input("Введите натуральное число "))

i = 1
a = 0
b = 0

for i in range(1, n+1, 1):
    a += i
    b = (n * (n + 1))/2


print("Перменая A - ", a)
print("Перменая B - ", b)
